Tekla Open API Reference for Tekla Structures 2025
Dialogs.OpenDialog Method
 Opens a dialog. The name of the dialog is asked from the Tekla Structures core.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static int OpenDialog(
	string param
)
Public Shared Function OpenDialog (
	param As String
) As Integer
Parameters
param
Type: System.String
Not used.
Return Value
Type: Int32
0 always.
See Also
Reference
Dialogs Class
Tekla.Structures.Dialog Namespace